/* ##########################################
# ДЗ к третьему уроку по Java на GeekBrains #
# ========================================= #
#                                           #
#                                           #
########################################## */

package ru.com.GeekBrains.Lesson3;

/*1.Написать программу, которая загадывает случайное число от 0 до 9, и пользователю дается 3 попытки угадать это число.
    При каждой попытке компьютер должен сообщить больше ли указанное пользователем число чем загаданное, или меньше.
    После победы или проигрыша выводится запрос – «Повторить игру еще раз? 1 – да / 0 – нет»(1 – повторить, 0 – нет).
 */

public class GuessTheNumber {
    public static void main(String[] args) {

    }
}
